## Análisis de datos - Clase 2

### Ejercicio: en el dataset provisto, identificar el tipo y subtipo de cada variable.

### Actividad 1: entender el dataset
Importa y hacer una exploración inicial del dataset para responer las preguntas que se encuentran a continuación.
Tip: pueden ser útiles los métodos `head()/tail()`, `info()`, `unique()`,`nunique()`, `value_counts()` y las propiedad `shape` y `columns` de pandas.

**Respuestas:**

1. Número de filas y columnas: 
2. Nombres de las columnas: 
3. Variables numéricas (y subtipo): 
4. Variables categóricas (y subtipo): 
5. ¿Tiene datos faltanes el dataset?

**Respuestas:**

1. Número de filas y columnas: 


2. Nombres de las columnas: `age`, `workclass`, `education-num`, `marital-status`, `occupation`, `sex`, `capital-gain`, `hours-per-week`, `income`. 

3. Variables numéricas (y subtipo): 

* Numéricas continuas: `capital-gain`, `hours-per-week`

* Numéricas discretas: `age` (continua, reportada como discreta)

4. Variables categóricas (y subtipo): 

* Categóricas ordinales: `education` 

* Categóricas nominales: `marital-status`, `occupation`, `workclass`

* Categórica binaria: `income` , `sex`

5. ¿Tiene datos faltanes el dataset?: no hay NaN, pero hay celdas con " ?" en `workclass`, `occupation`.

In [1]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

In [2]:
# Importar datasets/datos.csv en un df de Pandas  

df = pd.read_csv('../datasets/datos.csv')

In [3]:
# Visualizar las primeras filas del dataset
df.head()

,age,workclass,education,marital-status,occupation,sex,capital-gain,hours-per-week,income
0,39,State-gov,Bachelors,Never-married,Adm-clerical,Male,2174,40,<=50K
1,50,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Male,0,13,<=50K
2,38,Private,HS-grad,Divorced,Handlers-cleaners,Male,0,40,<=50K
3,53,Private,11th,Married-civ-spouse,Handlers-cleaners,Male,0,40,<=50K
4,28,Private,Bachelors,Married-civ-spouse,Prof-specialty,Female,0,40,<=50K

In [4]:
# Número de filas y columnas del dataset
df.shape

(32561, 9)

In [5]:
# Nombres de las columnas del dataset
df.columns.to_list()

['age',
 'workclass',
 'education',
 'marital-status',
 'occupation',
 'sex',
 'capital-gain',
 'hours-per-week',
 'income']

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32561 entries, 0 to 32560
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             32561 non-null  int64
 1   workclass       32561 non-null  object
 2   education       32561 non-null  object
 3   marital-status  32561 non-null  object
 4   occupation      32561 non-null  object
 5   sex             32561 non-null  object
 6   capital-gain    32561 non-null  int64
 7   hours-per-week  32561 non-null  int64
 8   income          32561 non-null  object
dtypes: int64(3), object(6)
memory usage: 2.2+ MB

In [7]:
# Explorar valores únucos de las variables

for columns in df.columns:
    total_unicos = df[columns].nunique()
    print(f"Columna: {columns} - total de valores únicos: {total_unicos}")

    if total_unicos < 20:
        print(df[columns].value_counts())
    print("\n")

Columna: age - total de valores únicos: 73


Columna: workclass - total de valores únicos: 9
workclass
 Private             22696
 Self-emp-not-inc     2541
 Local-gov            2093
 ?                    1836
 State-gov            1298
 Self-emp-inc         1116
 Federal-gov           960
 Without-pay            14
 Never-worked            7
Name: count, dtype: int64


Columna: education - total de valores únicos: 16
education
 HS-grad         10501
 Some-college     7291
 Bachelors        5355
 Masters          1723
 Assoc-voc        1382
11th              1175
 Assoc-acdm       1067
10th               933
7th-8th            646
 Prof-school       576
9th                514
12th               433
 Doctorate         413
5th-6th            333
1st-4th            168
 Preschool          51
Name: count, dtype: int64


Columna: marital-status - total de valores únicos: 7
marital-status
 Married-civ-spouse       14976
 Never-married            10683
 Divorced                  4443
 Separated                 1025
 Widowed                    993
 Married-spouse-absent      418
 Married-AF-spouse           23
Name: count, dtype: int64


Columna: occupation - total de valores únicos: 15
occupation
 Prof-specialty       4140
 Craft-repair         4099
 Exec-managerial      4066
 Adm-clerical         3770
 Sales                3650
 Other-service        3295
 Machine-op-inspct    2002
 ?                    1843
 Transport-moving     1597
 Handlers-cleaners    1370
 Farming-fishing       994
 Tech-support          928
 Protective-serv       649
 Priv-house-serv       149
 Armed-Forces            9
Name: count, dtype: int64


Columna: sex - total de valores únicos: 2
sex
 Male      21790
 Female    10771
Name: count, dtype: int64


Columna: capital-gain - total de valores únicos: 119


Columna: hours-per-week - total de valores únicos: 94


Columna: income - total de valores únicos: 2
income
<=50K    24720
>50K      7841
Name: count, dtype: int64

In [8]:
raros = [' ?', '? ', '?', 'N/A', 'n.a.', '-', 'missing', '.']
df.isin(raros).any()

age               False
workclass          True
education         False
marital-status    False
occupation         True
sex               False
capital-gain      False
hours-per-week    False
income            False
dtype: bool

In [ ]:
# Ejemplo: convertir los valores raros a NaN
df.replace(raros, pd.NA, inplace=True)

In [10]:
df.isin(raros).any()

age               False
workclass         False
education         False
marital-status    False
occupation        False
sex               False
capital-gain      False
hours-per-week    False
income            False
dtype: bool

In [ ]:
# Verificar que ahora aparecen los NaN en 'workclass' y 'occupation'
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32561 entries, 0 to 32560
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             32561 non-null  int64
 1   workclass       30725 non-null  object
 2   education       32561 non-null  object
 3   marital-status  32561 non-null  object
 4   occupation      30718 non-null  object
 5   sex             32561 non-null  object
 6   capital-gain    32561 non-null  int64
 7   hours-per-week  32561 non-null  int64
 8   income          32561 non-null  object
dtypes: int64(3), object(6)
memory usage: 2.2+ MB